1C_config/src/Documents/ЗаявкаНаКредит/ЗаявкаНаКредит.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКредит</name>
  <registerRecords>AccumulationRegister.ОстаткиНаСчетах</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
</mdclass:Document>

1C_config/src/AccumulationRegisters/ОстаткиНаСчетах/ОстаткиНаСчетах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНаСчетах</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

1C_config/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Одобрено</name>
  </enumValues>
  <enumValues>
    <name>Отказано</name>
  </enumValues>
  <enumValues>
    <name>Выдано</name>
  </enumValues>
</mdclass:Enum>

1C_config/src/Catalogs/БанковскиеСчета/БанковскиеСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БанковскиеСчета</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>CatalogRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Открыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОткрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

1C_config/src/Documents/ЗаявкаНаКредит/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    
    Дата = ТекущаяДата();
    Статус = Перечисления.СтатусыЗаявок.НаРассмотрении;
    
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Фиксируем пометку на удаление
    Если ПометкаУдаления И Не ЭтоНовый() И Не Ссылка.ПометкаУдаления Тогда
        Комментарий = "Заявка №" + Номер + " помечена на удаление";
        Журналирование.ЗаписатьДействие(Ссылка, "Пометка на удаление", Комментарий);
    КонецЕсли;
    
    // Фиксируем снятие пометки 
    Если Не ПометкаУдаления И Не ЭтоНовый() И Ссылка.ПометкаУдаления Тогда
        Комментарий = "Снята пометка удаления с заявки №" + Номер;
        Журналирование.ЗаписатьДействие(Ссылка, "Снятие пометки на удаление", Комментарий);
    КонецЕсли;
    
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // Проверка статуса
    Если Статус <> Перечисления.СтатусыЗаявок.Выдано Тогда
        Комментарий = "Заявка №" + Номер + " статус: " + Статус;
        Журналирование.ЗаписатьДействие(Ссылка, "Изменение статуса", Комментарий);
        Возврат;
    КонецЕсли;
    
    // Создаем новый счет для кредита
    НовыйСчет = Справочники.БанковскиеСчета.СоздатьЭлемент();
    НовыйСчет.Владелец = Клиент;
    НовыйСчет.Наименование = "Кредитный счет по заявке №" + Номер;
    НовыйСчет.ТипСчета = Справочники.ТипыСчетов.НайтиПоНаименованию("Кредитный");
    НовыйСчет.Валюта = Справочники.Валюты.НайтиПоКоду("643");
    НовыйСчет.Открыт = Истина;
    НовыйСчет.ДатаОткрытия = Дата;
    НовыйСчет.Записать();
    
    // Зачисляем сумму кредита
    Движения.ОстаткиНаСчетах.Очистить();
    
    Движение = Движения.ОстаткиНаСчетах.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Счет = НовыйСчет.Ссылка;
    Движение.Сумма = СуммаКредита;
    
    Движения.ОстаткиНаСчетах.Записывать = Истина;
    
    // Запись в журнал аудит о выдаче
    Комментарий = "ВЫДАЧА КРЕДИТА №" + Номер + " на сумму " + СуммаКредита + " руб. клиенту " + Клиент;
    Журналирование.ЗаписатьДействие(Ссылка, "Выдача кредита", Комментарий);
    
КонецПроцедуры

Процедура ОбработкаУдаления(Отказ, РежимУдаления)
    
    // Запись в аудит о физическом удалении 
	Комментарий = "Заявка №" + Номер + " физически удалена из базы";
    Журналирование.ЗаписатьДействие(Ссылка, "Физическое удаление", Комментарий);
    
КонецПроцедуры
